{
	"direction":{
		"LongName":"Relative direction between target locations (angle)",
		"Description":"The relative direction from the black target location to the red target location",
		"Units":"degrees"
	},
	"run":{
		"LongName":"Functional imaging run",
		"Description":"",
		"Levels":{
			"1":"run-1",
			"2":"run-2"
		}
	},
	"distance":{
		"LongName":"Distance between target locations",
		"Description":"The Euclidean distance between target locations measured from their respective centers, computed to represent a possible measure of difficulty.",
		"Units":"grid cells"
	},
	"blackY":{
		"LongName":"Black Y-coordinate (screen)",
		"Description":"Y-coordinate for the position of the center of the black target, measured in screen coordinates (center of the screen: 0; total screen height: 1)",
		"Units":"screen units"
	},
	"blackX":{
		"LongName":"Black x-coordinate (screen)",
		"Description":"X-coordinate for the position of the center of the black target, measured in screen coordinates (center of the screen: 0; total screen width: 1)",
		"Units":"screen units"
	},
	"blackYpos":{
		"LongName":"Black y-coordinate (grid)",
		"Description":"Y-coordinate for the position of the center of the black target, measured in grid cells (center of the screen: 0; total screen height: 8)",
		"Units":"grid cells"
	},
	"runSplit":{
		"LongName":"Balance stimulus characteristics across runs",
		"Description":"Pairs of map stimuli that were identified as having similar characteristics and thus assigned to opposite runs"
	},
	"blackToRed":{
		"LongName":"Relative direction between target locations (cardinal)",
		"Description":"The sub-cardinal direction from the black target location to the red target location.  The target in the west (left) was always assigned the black symbol (assigned to the button under the index finger of the right hand); possible values limited to northeast and southwest.",
		"Levels":{
			"1":"SE",
			"2":"NE"
		}	
	},
	"peakCount":{
		"LongName":"Count of peaks in the map data",
		"Description":"The number of local maxima in the data, computed to represent on possible measure of complexity in the map data.  See also 'avgClusterSize'."
	},
	"index":{
		"LongName":"Map index",
		"Description":"Unique identifier for the data set used in the map stimulus; redundant information in the 'track' field."
	},
	"audio":{
		"LongName":"Auditory condition",
		"Description":"Experimental condition and descriptive of the temporal arrangement of data within the respective auditory stream. The 'hybrid' condition shorthand for the 'augmented-sequential' condition listed elsewhere.",
		"Levels":{
			"1":"sequential",
			"2":"hybrid",
			"3":"concurrent"
		}
	},
	"redY":{
		"LongName":"Red y-coordinate (screen)",
		"Description":"Y-coordinate for the position of the center of the red target, measured in screen coordinates (center of the screen: 0; total screen height: 1)",
		"Units":"screen units"
	},
	"redX":{
		"LongName":"Red x-coordinate (screen)",
		"Description":"X-coordinate for the position of the center of the red target, measured in screen coordinates (center of the screen: 0; total screen width: 1)",
		"Units":"screen units"
	},
	"blackYpos":{
		"LongName":"Black x-coordinate (grid)",
		"Description":"X-coordinate for the position of the center of the black target, measured in grid cells (center of the screen: 0; total screen height: 8)",
		"Units":"grid cells"
	},
	"blackSize":{
		"LongName":"Size of the cluster around the black target",
		"Description":"Size of the cluster in which the black target is located; cluster determined as the grid cells that have the same data value as the target and are connected directly or indirectly to the target location by an adjacent side with a same-valued neighbor.",
		"Units":"grid cells"
	},
	"answerHigher":{
		"LongName":"Response option that has the higher data value",
		"Description":"The response option which contained the higher data value (correct task response)",
		"Levels":{
			"1":"black",
			"2":"red"	
		}
	},
	"redYpos":{
		"LongName":"Red y-coordinate (grid)",
		"Description":"Y-coordinate for the position of the center of the red target, measured in grid cells (center of the screen: 0; total screen height: 8)",
		"Units":"grid cells"
	},
	"response":{
		"LongName":"Response condition",
		"Description":"Response condition under which the participant made a decision about the relative value of the two target locations.",
		"Levels":{
			"1":"memory",
			"2":"active"
		}
	}
	"avgClusterSize":{
		"LongName":"Average size of clusters around peaks in the map data",
		"Description":"The average size of clusters around peaks (local maxima) in the data, computed to represent on possible measure of complexity in the map data.  Clusters were defined as contiguous groups of grid cells, in which adjacency was defined as a shared side.  See also 'peakCount'."
	},
	"redXpos":{
		"LongName":"Red x-coordinate (grid)",
		"Description":"X-coordinate for the position of the center of the red target, measured in grid cells (center of the screen: 0; total screen height: 8)",
		"Units":"grid cells"
	},
	"redSize":{
		"LongName":"Size of the cluster around the red target",
		"Description":"Size of the cluster in which the red target is located; cluster determined as the grid cells that have the same data value as the target and are connected directly or indirectly to the target location by an adjacent side with a same-valued neighbor.",
		"Units":"grid cells"
	},
	"run1.thisRepN":{
		"LongName":"Repetition of Run 1",
		"Description":"Counter for the repetitions of run 1 (0-up); constant as Run 1 was presented exactly once."
	},
	"run1.thisTrialN":{
		"LongName":"Trial number within Run 1",
		"Description":"Counter for the trial number of run 1 (0-up); sequential as the run progresses."
	},
	"run1.thisN":{
		"LongName":"Iteration number within Run 1",
		"Description":"Counter for the trial number of run 1 (0-up); sequential as the run progresses."
	},
	"run1.thisIndex":{
		"LongName":"Index into the stimuli for Run 1",
		"Description":"Index into the stimuli (randomized by participant) of Run 1 (0-up); randomized by participant and corresponds with stimulus identifier (see also 'index' and 'track')."
	},
	"run2.thisRepN":{
		"LongName":"Repetition of Run 2",
		"Description":"Counter for the repetitions of run 2 (0-up); constant as Run 2 was presented exactly once."
	},
	"run2.thisTrialN":{
		"LongName":"Trial number within Run 2",
		"Description":"Counter for the trial number of run 2 (0-up); sequential as the run progresses."
	},
	"run2.thisN":{
		"LongName":"Iteration number within Run 2",
		"Description":"Counter for the trial number of run 2 (0-up); sequential as the run progresses."
	},
	"run2.thisIndex":{
		"LongName":"Index into the stimuli for Run 2",
		"Description":"Index into the stimuli (randomized by participant) of Run 2 (0-up); randomized by participant and corresponds with stimulus identifier (see also 'index' and 'track')."
	},
	"track":{
		"LongName":"Stimulus filename",
		"Description":"Name of the file containing the auditory stimulus waveform; redundant information in the 'index' field."
	},
	"respondKey.keys":{
		"LongName":"Keypress corresponding to task response",
		"Description":"Record on keypress encoding the participant response through the button box. Four possible values; only two used in this data set as all participants happened to be right handed.  2 - middle finger, left hand (not used in this data set); 3 - index finger, left hand (not used in this data set); 6 - index finger, right hand; 7 - middle finger, right hand.",
		"Levels"{
			"1":"2",
			"2","3",
			"3":"6",
			"4":"7"
		}
	},
	"respondKey.corr":{
		"LongName":"Scored response",
		"Description":"Response scored as correct (1) or incorrect (0).",
		"Levels":{
			"1":"0",
			"2":"1"
		}
	},
	"respondKey.rt":{
		"LongName":"Response time",
		"Description":"Time elapsed from the presentation of the response options to the keypress indicating the participant's selected answer.",
		"Units":"seconds"
	},
	"session":{
		"LongName":"Session type",
		"Description":"Session type during which the log was recorded ('behavioral' = training)",
		"Levels":{
			"1":"scan",
			"2":"behavioral"
		}
	},
	"frameRate":{
		"LongName":"Graphics frame rate",
		"Description":"Frame rate for the graphic display; variability could indicate that the software was bogged down with processing, which in turn could indicate that the delivery of stimulus and recording of responses may have been on a compromised schedule.",
		"Units":"frames per second"
	},
	"preferredHand":{
		"LongName":"Participants self-reported preferred hand",
		"Description":"Participants self-reported preferred hand, and the hand used to enter responses to the behavioral task.  Two possible values; only one used in this data set as all participants happened to be right handed.",
		"Levels":{
			"1":"right",
			"2":"left"
		}
	},
	"expName":{
		"LongName":"Experiment name",
		"Description":"Name of the experiment and identifier for the software used to collect behavioral data; constant value: 'AudioCartography'"
	},
	"order":{
		"LongName":"Order of the runs with scan session",
		"Description":"The order in which runs were presented was counterbalanced across participants. Half of the participant listened to stimulus set A first, and B second (AB); the other half heard set B first, and A second (BA).",
		"Levels":{
			"1":"AB",
			"2":"BA"
		}
	}
}